In [1]:
import pandas as pd
df = pd.read_csv(".//num2.csv",names=["phone"],header=None)
df.phone=df.phone.str.replace(' ','')

In [2]:
df

            phone
0     07875385749
1     01702291167
2     01743293876
3     07880354794
4     01270442279
...           ...
4964  07779244958
4965  07507680075
4966  01608737971
4967  01733332911
4968  07956639507

[4969 rows x 1 columns]

In [3]:
df2 = pd.read_csv(".//num.csv",header=None,names=["phone"])

In [4]:
dff = pd.concat([df,df2])

In [5]:
dff.drop_duplicates(inplace=True)

In [6]:
dff = dff[dff['phone'].str.startswith('07')]

In [7]:
dff

           phone
0    07875385749
3    07880354794
5    07967967680
6    07990537878
7    07885720080
..           ...
675  07702783252
676  07756222516
678  07495800790
679  07487621999
680  07830776941

[2328 rows x 1 columns]

In [15]:
dff.to_csv(".//all_nums07.csv",index=False,header=False)